Revit 2024 API
DirectShapeTargetViewType Enumeration
 View types for which DirectShape objects are allowed to have alternative shape representations
 View types for which DirectShape objects are allowed to have alternative shape representations. Currently limited to Plan Views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Since: 2015
Syntax
C#
public enum DirectShapeTargetViewType
Visual Basic
Public Enumeration DirectShapeTargetViewType
Visual C++
public enum class DirectShapeTargetViewType
Members
Member name | Description
Undefined |  Invalid value
Default |  Shape to be used in all views for which a view-specific shape was not provided
Plan |  The alternate representation will be used only in Revit Plan views
See Also
Autodesk.Revit.DB Namespace